using System.Collections;
using System.Collections.Generic;
using System;
using System.Linq;
using UnityEngine;
using UnityEngine.UI;
using UnityEngine.Networking;
public class RegScript : MonoBehaviour
{
    Dictionary<string,int> dictionary=new Dictionary<string, int>();
    public MessageBox msg;
    public GameObject RegisterPanel;
    public InputField inputField_ID;
    public InputField inputField_email;
    public InputField inputField_pw;
    public InputField inputField_repw;
    public InputField inputField_nic;
    public Text pwsametext;
    public Button Button_reg;
    public Dropdown AreaOne;//시/도 드롭다운
    public Dropdown AreaTwo;//시군구드롭다운
    public Dropdown AreaThird;//읍면동 드롭다운
    string ID;//아이디값 저장공간
    string password;//비밀번호 저장공간
    string nicname;//닉네임 저장공간
    string TotalArea;
    Boolean idcheck=false;
    Boolean pwsamecheck=false;
    Boolean pwokcheck=false;
    Boolean nicknamecheck=false;
    Boolean areacheck=false;
//지역관리  (시도)////
    public string[] seoul = new string[] { "강남구", "강동구", "강북구", "강서구", "관악구", "광진구", "구로구", "금천구", "노원구", "도봉구", "동대문구", "동작구", "마포구", "서대문구", "서초구", "성동구",
    "성북구", "송파구", "양천구", "영등포구","용산구", "은평구", "종로구", "중구", "중랑구" };
    public string[] gangwando = new string[] { "강릉시", "고성군", "동해시", "삼척시", "속초시", "양구군", "양양군", "영월군", "원주시", "인제군", "정선군", "철원군", "춘천시", "태백시", "평창군", "홍천군", "화천군", "횡성군" };
    public string[] ganggido = new string[]{ "가평군","고양시덕양구","고양시일산동구","고양시일산서구","과천시","광명시","광주시","구리시","군포시","김포시","남양주시","동두천시","부천시"
,"성남시분당구"
,"성남시수정구"
,"성남시중원구"
,"수원시권선구"
,"수원시영통구"
,"수원시장안구"
,"수원시팔달구"
,"시흥시"
,"안산시단원구"
,"안산시상록구"
,"안성시"
,"안양시동안구"
,"안양시만안구"
,"양주시"
,"양평군"
,"여주시"
,"연천군"
,"오산시"
,"용인시기흥구"
,"용인시수지구"
,"용인시처인구"
,"의왕시"
,"의정부시"
,"이천시"
,"파주시"
,"평택시"
,"포천시"
,"하남시"
,"화성시" };//경기도
    public string[] gangsannamdo = new string[] {"거제시"
,"거창군"
,"고성군"
,"김해시"
,"남해군"
,"밀양시"
,"사천시"
,"산청군"
,"양산시"
,"의령군"
,"진주시"
,"창녕군"
,"창원시 마산합포구"
,"창원시 마산회원구"
,"창원시 성산구"
,"창원시 의창구"
,"창원시 진해구"
,"통영시"
,"하동군"
,"함안군"
,"함양군"
,"합천군" };//경상남도
    public string[] gangsanbookdo = new string[] {"경산시"
,"경주시"
,"고령군"
,"구미시"
,"군위군"
,"김천시"
,"문경시"
,"봉화군"
,"상주시"
,"성주군"
,"안동시"
,"영덕군"
,"영양군"
,"영주시"
,"영천시"
,"예천군"
,"울릉군"
,"울진군"
,"의성군"
,"청도군"
,"청송군"
,"칠곡군"
,"포항시남구"
,"포항시북구" };//경상북도
    public string[] gangju = new string[] {"광산구"
,"남구"
,"동구"
,"북구"
,"서구" };//광주광역시
    public string[] daegu = new string[] { "남구"
,"달서구"
,"달성군"
,"동구"
,"북구"
,"서구"
,"수성구"
,"중구"};//대구광역시
    public string[] daejun = new string[] { "대덕구"
,"동구"
,"서구"
,"유성구"
,"중구"
};//대전광역시
    public string[] busan = new string[] {"강서구"
,"금정구"
,"기장군"
,"남구"
,"동구"
,"동래구"
,"부산진구"
,"북구"
,"사상구"
,"사하구"
,"서구"
,"수영구"
,"연제구"
,"영도구"
,"중구"
,"해운대구" };//부산광역시
    public string[] seojong = new string[] { "세종특별자치시" };//세종특별자치시
    public string[] ulsan = new string[] {"남구"
,"동구"
,"북구"
,"울주군"
,"중구" };//울산광역시
    public string[] incheon = new string[] {"강화군"
,"계양구"
,"남동구"
,"동구"
,"미추홀구"
,"부평구"
,"서구"
,"연수구"
,"옹진군"
,"중구" };//인천광역시
    public string[] junlanamdo = new string[] { "강진군"
,"고흥군"
,"곡성군"
,"광양시"
,"구례군"
,"나주시"
,"담양군"
,"목포시"
,"무안군"
,"보성군"
,"순천시"
,"신안군"
,"여수시"
,"영광군"
,"영암군"
,"완도군"
,"장성군"
,"장흥군"
,"진도군"
,"함평군"
,"해남군"
,"화순군"};//전라남도
    public string[] junlabookdo = new string[] {"고창군"
,"군산시"
,"김제시"
,"남원시"
,"무주군"
,"부안군"
,"순창군"
,"완주군"
,"익산시"
,"임실군"
,"장수군"
,"전주시덕진구"
,"전주시완산구"
,"정읍시"
,"진안군" };//전라북도
    public string[] jeju = new string[] { "서귀포시"
,"이어도"
,"제주시"
};//제주특별자치도
    public string[] chungnam= new string[] { "계룡시"
,"공주시"
,"금산군"
,"논산시"
,"당진시"
,"보령시"
,"부여군"
,"서산시"
,"서천군"
,"아산시"
,"예산군"
,"천안시동남구"
,"천안시서북구"
,"청양군"
,"태안군"
,"홍성군"};//충청남도
    public string[] chungbook = new string[] {"괴산군"
,"단양군"
,"보은군"
,"영동군"
,"옥천군"
,"음성군"
,"제천시"
,"증평군"
,"진천군"
,"청주시상당구"
,"청주시서원구"
,"청주시청원구"
,"청주시흥덕구"
,"충주시" };//충청북도


    //읍면동 관리
    //서울
    public string[] a1 = new string[] { "개포1동"
,"개포2동"
,"개포4동"
,"논현1동"
,"논현2동"
,"대치1동"
,"대치2동"
,"대치4동"
,"도곡1동"
,"도곡2동"
,"삼성1동"
,"삼성2동"
,"세곡동"
,"수서동"
,"신사동"
,"압구정동"
,"역삼1동"
,"역삼2동"
,"일원1동"
,"일원2동"
,"일원본동"
,"청담동"
};
    public string[] a2 = new string[] { "강일동"
,"고덕제1동"
,"고덕제2동"
,"길동"
,"둔촌제1동"
,"둔촌제2동"
,"명일제1동"
,"명일제2동"
,"상일제1동"
,"상일제2동"
,"성내제1동"
,"성내제2동"
,"성내제3동"
,"암사제1동"
,"암사제2동"
,"암사제3동"
,"천호제1동"
,"천호제2동"
,"천호제3동"
    };
    public string[] a3 = new string[] { "미아동"
,"번1동"
,"번2동"
,"번3동"
,"삼각산동"
,"삼양동"
,"송중동"
,"송천동"
,"수유1동"
,"수유2동"
,"수유3동"
,"우이동"
,"인수동"
};
    public string[] a4 = new string[] { "가양제1동"
,"가양제2동"
,"가양제3동"
,"공항동"
,"등촌제1동"
,"등촌제2동"
,"등촌제3동"
,"발산제1동"
,"방화제1동"
,"방화제2동"
,"방화제3동"
,"염창동"
,"우장산동"
,"화곡본동"
,"화곡제1동"
,"화곡제2동"
,"화곡제3동"
,"화곡제4동"
,"화곡제6동"
,"화곡제8동"
};
    public string[] a5 = new string[] {"낙성대동"
,"난곡동"
,"난향동"
,"남현동"
,"대학동"
,"미성동"
,"보라매동"
,"삼성동"
,"서림동"
,"서원동"
,"성현동"
,"신림동"
,"신사동"
,"신원동"
,"은천동"
,"인헌동"
,"조원동"
,"중앙동"
,"청룡동"
,"청림동"
,"행운동"
 };
    public string[] a6 = new string[] {"광장동"
,"구의제1동"
,"구의제2동"
,"구의제3동"
,"군자동"
,"능동"
,"자양제1동"
,"자양제2동"
,"자양제3동"
,"자양제4동"
,"중곡제1동"
,"중곡제2동"
,"중곡제3동"
,"중곡제4동"
,"화양동"
 };
    public string[] a7 = new string[] { "가리봉동"
,"개봉제1동"
,"개봉제2동"
,"개봉제3동"
,"고척제1동"
,"고척제2동"
,"구로제1동"
,"구로제2동"
,"구로제3동"
,"구로제4동"
,"구로제5동"
,"수궁동"
,"신도림동"
,"오류제1동"
,"오류제2동"
,"항동"
};
    public string[] a8 = new string[] { "가산동"
,"독산제1동"
,"독산제2동"
,"독산제3동"
,"독산제4동"
,"시흥제1동"
,"시흥제2동"
,"시흥제3동"
,"시흥제4동"
,"시흥제5동"
};
    public string[] a9 = new string[] {"공릉1동"
,"공릉2동"
,"상계10동"
,"상계1동"
,"상계2동"
,"상계3.4동"
,"상계5동"
,"상계6.7동"
,"상계8동"
,"상계9동"
,"월계1동"
,"월계2동"
,"월계3동"
,"중계1동"
,"중계2.3동"
,"중계동4"
,"중계본동"
,"하계동1"
,"하계동2"
 };
    public string[] aa1 = new string[] {"도봉제1동"
,"도봉제2동"
,"방학제1동"
,"방학제2동"
,"방학제3동"
,"쌍문제1동"
,"쌍문제2동"
,"쌍문제3동"
,"쌍문제4동"
,"창제1동"
,"창제2동"
,"창제3동"
,"창제4동"
,"창제5동"
 };
    public string[] aa2 = new string[] {"답십리제1동"
,"답십리제2동"
,"용신동"
,"이문제1동"
,"이문제2동"
,"장안제1동"
,"장안제2동"
,"전농제1동"
,"전농제2동"
,"제기동"
,"청량리동"
,"회기동"
,"휘경제1동"
,"휘경제2동"
 };
    public string[] aa3 = new string[] {"노량진제1동"
,"노량진제2동"
,"대방동"
,"사당제1동"
,"사당제2동"
,"사당제3동"
,"사당제4동"
,"사당제5동"
,"상도제1동"
,"상도제2동"
,"상도제3동"
,"상도제4동"
,"신대방제1동"
,"신대방제2동"
,"흑석동"
 };
    public string[] aa4 = new string[] { "공덕동"
,"대흥동"
,"도화동"
,"망원제1동"
,"망원제2동"
,"상암동"
,"서강동"
,"서교동"
,"성산제1동"
,"성산제2동"
,"신수동"
,"아현동"
,"연남동"
,"염리동"
,"용강동"
,"합정동"
};
    public string[] aa5 = new string[] {"남가좌제1동"
,"남가좌제2동"
,"북가좌제1동"
,"북가좌제2동"
,"북아현동"
,"신촌동"
,"연희동"
,"천연동"
,"충현동"
,"홍은제1동"
,"홍은제2동"
,"홍제제1동"
,"홍제제2동"
,"홍제제3동"
 };
    public string[] aa6 = new string[] {"내곡동"
,"반포1동"
,"반포2동"
,"반포3동"
,"반포4동"
,"반포본동"
,"방배1동"
,"방배2동"
,"방배3동"
,"방배4동"
,"방배본동"
,"서초1동"
,"서초2동"
,"서초3동"
,"서초4동"
,"양재1동"
,"양재2동"
,"잠원동"
 };
    public string[] aa7 = new string[] {"금호1가동"
,"금호2.3가동"
,"금호4가동"
,"마장동"
,"사근동"
,"성수1가제1동"
,"성수1가제2동"
,"성수2가제1동"
,"성수2가제3동"
,"송정동"
,"옥수동"
,"왕십리도선동"
,"왕십리제2동"
,"용답동"
,"응봉동"
,"행당제1동"
,"행당제2동"
 };
    public string[] aa8 = new string[] { "길음제1동"
,"길음제2동"
,"돈암제1동"
,"돈암제2동"
,"동선동"
,"보문동"
,"삼선동"
,"석관동"
,"성북동"
,"안암동"
,"월곡제1동"
,"월곡제2동"
,"장위제1동"
,"장위제2동"
,"장위제3동"
,"정릉제1동"
,"정릉제2동"
,"정릉제3동"
,"정릉제4동"
};
    public string[] aa9 = new string[] { "가락1동"
,"가락2동"
,"가락본동"
,"거여1동"
,"거여2동"
,"마천1동"
,"마천2동"
,"문정1동"
,"문정2동"
,"방이1동"
,"방이2동"
,"삼전동"
,"석촌동"
,"송파1동"
,"송파2동"
,"오금동"
,"오륜동"
,"위례동"
,"잠실2동"
,"잠실3동"
,"잠실4동"
,"잠실6동"
,"잠실7동"
,"잠실본동"
,"장지동"
,"풍납1동"
,"풍납2동"
};
    public string[] aa10 = new string[] {"목1동"
,"목2동"
,"목3동"
,"목4동"
,"목5동"
,"신월1동"
,"신월2동"
,"신월3동"
,"신월4동"
,"신월5동"
,"신월6동"
,"신월7동"
,"신정1동"
,"신정2동"
,"신정3동"
,"신정4동"
,"신정6동"
,"신정7동"
};
    public string[] aaa1 = new string[] {"당산제1동"
,"당산제2동"
,"대림제1동"
,"대림제2동"
,"대림제3동"
,"도림동"
,"문래동"
,"신길제1동"
,"신길제3동"
,"신길제4동"
,"신길제5동"
,"신길제6동"
,"신길제7동"
,"양평제1동"
,"양평제2동"
,"여의동"
,"영등포동"
,"영등포본동"
  };
    public string[] aaa2 = new string[] { "남영동"
,"보광동"
,"서빙고동"
,"용문동"
,"용산2가동"
,"원효로제1동"
,"원효로제2동"
,"이촌제1동"
,"이촌제2동"
,"이태원제1동"
,"이태원제2동"
,"청파동"
,"한강로동"
,"한남동"
,"효창동"
,"후암동"
};
    public string[] aaa3 = new string[] { "갈현제1동"
,"갈현제2동"
,"구산동"
,"녹번동"
,"대조동"
,"불광제1동"
,"불광제2동"
,"수색동"
,"신사제1동"
,"신사제2동"
,"역촌동"
,"응암제1동"
,"응암제2동"
,"응암제3동"
,"증산동"
,"진관동"
};
    public string[] aaa4 = new string[] { "가회동"
,"교남동"
,"무악동"
,"부암동"
,"사직동"
,"삼청동"
,"숭인제1동"
,"숭인제2동"
,"이화동"
,"종로1.2.3.4가동"
,"종로5.6가동"
,"창신제1동"
,"창신제2동"
,"창신제3동"
,"청운효자동"
,"평창동"
,"혜화동"
};
    public string[] aaa5 = new string[] {"광희동"
,"다산동"
,"동화동"
,"명동"
,"소공동"
,"신당동"
,"신당제5동"
,"약수동"
,"을지로동"
,"장충동"
,"중림동"
,"청구동"
,"필동"
,"황학동"
,"회현동"
 };
    public string[] aaa6 = new string[] {"망우본동"
,"망우제3동"
,"면목본동"
,"면목제2동"
,"면목제3.8동"
,"면목제4동"
,"면목제5동"
,"면목제7동"
,"묵제1동"
,"묵제2동"
,"상봉제1동"
,"상봉제2동"
,"신내1동"
,"신내2동"
,"중화제1동"
,"중화제2동" };
    //강원도
    public string[] b1 = new string[] { "강남동"
,"강동면"
,"경포동"
,"교1동"
,"교2동"
,"구정면"
,"내곡동"
,"사천면"
,"성덕동"
,"성산면"
,"송정동"
,"연곡면"
,"옥계면"
,"옥천동"
,"왕산면"
,"주문진읍"
,"중앙동"
,"초당동"
,"포남1동"
,"포남2동"
,"홍제동"
};
    public string[] b2 = new string[] { "간성읍"
,"거진읍"
,"수동면"
,"죽왕면"
,"토성면"
,"현내면"
};
    public string[] b3 = new string[] {"동호동"
,"망상동"
,"묵호동"
,"발한동"
,"부곡동"
,"북삼동"
,"북평동"
,"삼화동"
,"송정동"
,"천곡동"
 };
    public string[] b4 = new string[] { "가곡면"
,"교동"
,"근덕면"
,"남양동"
,"노곡면"
,"도계읍"
,"미로면"
,"성내동"
,"신기면"
,"원덕읍"
,"정라동"
,"하장면"
};
    public string[] b5 = new string[] {"교동"
,"금호동"
,"노학동"
,"대포동"
,"동명동"
,"영랑동"
,"조양동"
,"청호동"
 };
    public string[] b6 = new string[] {"국토정중앙면"
,"동면"
,"방산면"
,"양구읍"
,"해안면"
 };
    public string[] b7 = new string[] {"강현면"
,"서면"
,"손양면"
,"양양읍"
,"현남면"
,"현북면"
 };
    public string[] b8 = new string[] {"김삿갓면"
,"남면"
,"무릉도원면"
,"북면"
,"상동읍"
,"영월읍"
,"주천면"
,"중동면"
,"한반도면"
 };
    public string[] b9 = new string[] { "개운동"
,"귀래면"
,"단계동"
,"단구동"
,"명륜1동"
,"명륜2동"
,"무실동"
,"문막읍"
,"반곡관설동"
,"봉산동"
,"부론면"
,"소초면"
,"신림면"
,"우산동"
,"원인동"
,"일산동"
,"중앙동"
,"지정면"
,"태장1동"
,"태장2동"
,"판부면"
,"학성동"
,"행구동"
,"호저면"
,"흥업면"
};
    public string[] bb1 = new string[] { "기린면"
,"남면"
,"북면"
,"상남면"
,"서화면"
,"인제읍"
};
    public string[] bb2 = new string[] {"고한읍"
,"남면"
,"북평면"
,"사북읍"
,"신동읍"
,"여량면"
,"임계면"
,"정선읍"
,"화암면"
 };
    public string[] bb3 = new string[] {"갈말읍"
,"근남면"
,"근동면"
,"근북면"
,"김화읍"
,"동송읍"
,"서면"
,"원남면"
,"원동면"
,"임남면"
,"철원읍"
 };
    public string[] bb4 = new string[] { "강남동"
,"교동"
,"근화동"
,"남면"
,"남산면"
,"동내면"
,"동면"
,"동산면"
,"북산면"
,"사북면"
,"서면"
,"석사동"
,"소양동"
,"신동면"
,"신북읍"
,"신사우동"
,"약사명동"
,"조운동"
,"퇴계동"
,"효자1동"
,"효자2동"
,"효자3동"
,"후평1동"
,"후평2동"
,"후평3동"
};
    public string[] bb5 = new string[] {"구문소동"
,"문곡소도동"
,"삼수동"
,"상장동"
,"장성동"
,"철암동"
,"황연동"
,"황지동"
 };
    public string[] bb6 = new string[] {"대관령면"
,"대화면"
,"미탄면"
,"방림면"
,"봉평면"
,"용평면"
,"진부면"
,"평창읍"
 };
    public string[] bb7 = new string[] { "남면"
,"내면"
,"내촌면"
,"두촌면"
,"북방면"
,"서면"
,"서석면"
,"영귀미면"
,"홍천읍"
,"화촌면"
};
    public string[] bb8 = new string[] {"간동면"
,"사내면"
,"상서면"
,"하남면"
,"화천읍"
 };
    public string[] bb9 = new string[] {"갑천면"
,"강림면"
,"공근면"
,"둔내면"
,"서원면"
,"안흥면"
,"우천면"
,"청일면"
,"횡성읍" };

    //경기도
    public string[] c1 = new string[] { "가평읍"
,"북면"
,"상면"
,"설악면"
,"조종면"
,"청평면"
};
    public string[] c2 = new string[] {"고양동"
,"관산동"
,"능곡동"
,"대덕동"
,"삼송동"
,"성사1동"
,"성사2동"
,"원신동"
,"주교동"
,"창릉동"
,"행신1동"
,"행신2동"
,"행신3동"
,"행주동"
,"화전동"
,"화정1동"
,"화정2동"
,"효자동"
,"흥도동"
};
    public string[] c3 = new string[] { "고봉동"
,"마두1동"
,"마두2동"
,"백석1동"
,"백석2동"
,"식사동"
,"장항1동"
,"장항2동"
,"정발산동"
,"중산동"
,"풍산동"
 };
    public string[] c4 = new string[] { "대화동"
,"송산동"
,"송포동"
,"일산1동"
,"일산2동"
,"일산3동"
,"주엽1동"
,"주엽2동"
,"탄현동"
};
    public string[] c5 = new string[] { "갈현동"
,"과천동"
,"문원동"
,"별양동"
,"부림동"
,"중앙동"
};
    public string[] c6 = new string[] { "광명1동"
,"광명2동"
,"광명3동"
,"광명4동"
,"광명5동"
,"광명6동"
,"광명7동"
,"소하1동"
,"소하2동"
,"철산1동"
,"철산2동"
,"철산3동"
,"철산4동"
,"하안1동"
,"하안2동"
,"하안3동"
,"하안4동"
,"학온동"
};
    public string[] c7 = new string[] {"경안동"
,"곤지암읍"
,"광남1동"
,"광남2동"
,"남종면"
,"남한산성면"
,"도척면"
,"송정동"
,"쌍령동"
,"오포읍"
,"초월읍"
,"탄벌동"
,"퇴촌면"
 };
    public string[] c8 = new string[] {"갈매동"
,"교문1동"
,"교문2동"
,"동구동"
,"수택1동"
,"수택2동"
,"수택3동"
,"인창동"
 };
    public string[] c9 = new string[] {"광정동"
,"군포1동"
,"군포2동"
,"궁내동"
,"금정동"
,"대야동"
,"산본1동"
,"산본2동"
,"송부동"
,"수리동"
,"오금동"
,"재궁동"
 };
    public string[] cc1 = new string[] { "고촌읍"
,"구래동"
,"김포본동"
,"대곶면"
,"마산동"
,"사우동"
,"양촌읍"
,"운양동"
,"월곶면"
,"장기동"
,"장기본동"
,"통진읍"
,"풍무동"
,"하성면"
    };
    public string[] cc2 = new string[] {"금곡동"
,"다산1동"
,"다산2동"
,"별내동"
,"별내면"
,"수동면"
,"양정동"
,"오남읍"
,"와부읍"
,"조안면"
,"진건읍"
,"진접읍"
,"퇴계원읍"
,"평내동"
,"호평동"
,"화도읍"
 };
    public string[] cc3 = new string[] { "보산동"
,"불현동"
,"상패동"
,"생연1동"
,"생연2동"
,"소요동"
,"송내동"
,"중앙동"
};
    public string[] cc4 = new string[] {"대산동"
,"범안동"
,"부천동"
,"상동"
,"성곡동"
,"소사본동"
,"신중동"
,"심곡동"
,"오정동"
,"중동"
 };
    public string[] cc5 = new string[] {"구미1동"
,"구미동"
,"금곡동"
,"백현동"
,"분당동"
,"삼평동"
,"서현1동"
,"서현2동"
,"수내1동"
,"수내2동"
,"수내3동"
,"야탑1동"
,"야탑2동"
,"야탑3동"
,"운중동"
,"이매1동"
,"이매2동"
,"정자1동"
,"정자2동"
,"정자3동"
,"정자동"
,"판교동"
 };
    public string[] cc6 = new string[] {"고등동"
,"단대동"
,"복정동"
,"산성동"
,"수진1동"
,"수진2동"
,"시흥동"
,"신촌동"
,"신흥1동"
,"신흥2동"
,"신흥3동"
,"양지동"
,"위례동"
,"태평1동"
,"태평2동"
,"태평3동"
,"태평4동"
 };
    public string[] cc7 = new string[] {"금광1동"
,"금광2동"
,"도촌동"
,"상대원1동"
,"상대원2동"
,"상대원3동"
,"성남동"
,"은행1동"
,"은행2동"
,"중앙동"
,"하대원동"
 };
    public string[] cc8 = new string[] { "곡선동"
,"구운동"
,"권선1동"
,"권선2동"
,"금곡동"
,"서둔동"
,"세류1동"
,"세류2동"
,"세류3동"
,"입북동"
,"평동"
,"호매실동"
};
    public string[] cc9  = new string[] {"광교1동"
,"광교2동"
,"망포1동"
,"망포2동"
,"매탄1동"
,"매탄2동"
,"매탄3동"
,"매탄4동"
,"영통1동"
,"영통2동"
,"영통3동"
,"원천동"
 };
    public string[] ccc1 = new string[] {"송죽동"
,"연무동"
,"영화동"
,"율천동"
,"정자1동"
,"정자2동"
,"정자3동"
,"조원1동"
,"조원2동"
,"파장동"
 };
    public string[] ccc2 = new string[] {"고등동"
,"매교동"
,"매산동"
,"우만1동"
,"우만2동"
,"인계동"
,"지동"
,"행궁동"
,"화서1동"
,"화서2동"
 };
    public string[] ccc3 = new string[] {"과림동"
,"군자동"
,"능곡동"
,"대야동"
,"매화동"
,"목감동"
,"배곧1동"
,"배곧2동"
,"신천동"
,"신현동"
,"연성동"
,"월곶동"
,"은행동"
,"장곡동"
,"정왕1동"
,"정왕2동"
,"정왕3동"
,"정왕4동"
,"정왕본동"
 };
    public string[] ccc4 = new string[] {"고잔동"
,"대부동"
,"백운동"
,"선부1동"
,"선부2동"
,"선부3동"
,"신길동"
,"와동"
,"원곡동"
,"중앙동"
,"초지동"
,"호수동"
};
    public string[] ccc5 = new string[] { "반월동"
,"본오1동"
,"본오2동"
,"본오3동"
,"부곡동"
,"사동"
,"사이동"
,"성포동"
,"안산동"
,"월피동"
,"이동"
,"일동"
,"해양동"
 };
    public string[] ccc6 = new string[] {"고삼면"
,"공도읍"
,"금광면"
,"대덕면"
,"미양면"
,"보개면"
,"삼죽면"
,"서운면"
,"안성1동"
,"안성2동"
,"안성3동"
,"양성면"
,"원곡면"
,"일죽면"
,"죽산면"
 };
    public string[] ccc7 = new string[] {"갈산동"
,"관양1동"
,"관양2동"
,"귀인동"
,"달안동"
,"범계동"
,"부림동"
,"부흥동"
,"비산1동"
,"비산2동"
,"비산3동"
,"신촌동"
,"평안동"
,"평촌동"
,"호계1동"
,"호계2동"
,"호계3동"
};
    public string[] ccc8 = new string[] {"박달1동"
,"박달2동"
,"석수1동"
,"석수2동"
,"석수3동"
,"안양1동"
,"안양2동"
,"안양3동"
,"안양4동"
,"안양5동"
,"안양6동"
,"안양7동"
,"안양8동"
,"안양9동"
  };
    public string[] ccc9 = new string[] {"광적면"
,"남면"
,"백석읍"
,"양주1동"
,"양주2동"
,"은현면"
,"장흥면"
,"회천1동"
,"회천2동"
,"회천3동"
,"회천4동"
};
    public string[] cccc1 = new string[] {"강상면"
,"강하면"
,"개군면"
,"단월면"
,"서종면"
,"양동면"
,"양서면"
,"양평읍"
,"옥천면"
,"용문면"
,"지평면"
,"청운면"
};
    public string[] cccc2 = new string[] {"가남읍"
,"강천면"
,"금사면"
,"능서면"
,"대신면"
,"북내면"
,"산북면"
,"여흥동"
,"오학동"
,"점동면"
,"중앙동"
,"흥천면"
 };
    public string[] cccc3 = new string[] {"군남면"
,"미산면"
,"백학면"
,"신서면"
,"연천읍"
,"왕징면"
,"장남면"
,"전곡읍"
,"중면"
,"청산면"
 };
    public string[] cccc4 = new string[] {"남촌동"
,"대원동"
,"세마동"
,"신장동"
,"중앙동"
,"초평동"
 };
    public string[] cccc5 = new string[] {"구갈동"
,"구성동"
,"기흥동"
,"동백1동"
,"동백2동"
,"동백3동"
,"마북동"
,"보라동"
,"보정동"
,"상갈동"
,"상하동"
,"서농동"
,"신갈동"
,"영덕1동"
,"영덕2동"
 };
    public string[] cccc6 = new string[] { "동천동"
,"상현1동"
,"상현2동"
,"상현3동"
,"성복동"
,"신봉동"
,"죽전1동"
,"죽전2동"
,"죽전3동"
,"풍덕천1동"
,"풍덕천2동"
    };
    public string[] cccc7 = new string[] {"남사읍"
,"동부동"
,"모현읍"
,"백암면"
,"삼가동"
,"양지면"
,"역북동"
,"원삼면"
,"유림동"
,"이동읍"
,"중앙동"
,"포곡읍"
 };
    public string[] cccc8 = new string[] {"고천동"
,"내손1동"
,"내손2동"
,"부곡동"
,"오전동"
,"청계동"
};
    public string[] cccc9 = new string[] { "가능동"
,"녹양동"
,"송산1동"
,"송산2동"
,"송산3동"
,"신곡1동"
,"신곡2동"
,"의정부1동"
,"의정부2동"
,"자금동"
,"장암동"
,"호원1동"
,"호원2동"
,"흥선동"
 };
    public string[] ccccc1 = new string[] {"관고동"
,"대월면"
,"마장면"
,"모가면"
,"백사면"
,"부발읍"
,"설성면"
,"신둔면"
,"율면"
,"장호원읍"
,"중리동"
,"증포동"
,"창전동"
,"호법면"
    };
    public string[] ccccc2 = new string[] {"광탄면"
,"교하동"
,"금촌1동"
,"금촌2동"
,"금촌3동"
,"문산읍"
,"법원읍"
,"운정1동"
,"운정2동"
,"운정3동"
,"월롱면"
,"장단면"
,"적성면"
,"조리읍"
,"탄현면"
,"파주읍"
,"파평면"
};
    public string[] ccccc3 = new string[] {"고덕면"
,"비전1동"
,"비전2동"
,"서정동"
,"서탄면"
,"세교동"
,"송북동"
,"송탄동"
,"신장1동"
,"신장2동"
,"신평동"
,"안중읍"
,"오성면"
,"용이동"
,"원평동"
,"중앙동"
,"지산동"
,"진위면"
,"청북읍"
,"통복동"
,"팽성읍"
,"포승읍"
,"현덕면"
 };
    public string[] ccccc4 = new string[] {"가산면"
,"관인면"
,"군내면"
,"내촌면"
,"선단동"
,"소흘읍"
,"신북면"
,"영북면"
,"영중면"
,"이동면"
,"일동면"
,"창수면"
,"포천동"
,"화현면"
 };
    public string[] ccccc5 = new string[] { "감북동"
,"감일동"
,"덕풍1동"
,"덕풍2동"
,"덕풍3동"
,"미사1동"
,"미사2동"
,"신장1동"
,"신장2동"
,"위례동"
,"천현동"
,"초이동"
,"춘궁동"
,"풍산동"
};
    public string[] ccccc6 = new string[] { "기배동"
,"남양읍"
,"동탄1동"
,"동탄2동"
,"동탄3동"
,"동탄4동"
,"동탄5동"
,"동탄6동"
,"동탄7동"
,"동탄8동"
,"마도면"
,"매송면"
,"반월동"
,"병점1동"
,"병점2동"
,"봉담읍"
,"비봉면"
,"새솔동"
,"서신면"
,"송산면"
,"양감면"
,"우정읍"
,"장안면"
,"정남면"
,"진안동"
,"팔탄면"
,"향남읍"
,"화산동"};
    //경상남도
    public string[] d1 = new string[] { "거제면"
,"고현동"
,"남부면"
,"능포동"
,"동부면"
,"둔덕면"
,"사등면"
,"상문동"
,"수양동"
,"아주동"
,"연초면"
,"옥포1동"
,"옥포2동"
,"일운면"
,"장목면"
,"장승포동"
,"장평동"
,"하청면"
};
    public string[] d2 = new string[] { "가북면"
,"가조면"
,"거창읍"
,"고제면"
,"남상면"
,"남하면"
,"마리면"
,"북상면"
,"신원면"
,"웅양면"
,"위천면"
,"주상면"
};
    public string[] d3 = new string[] {"개천면"
,"거류면"
,"고성읍"
,"구만면"
,"대가면"
,"동해면"
,"마암면"
,"삼산면"
,"상리면"
,"영오면"
,"영현면"
,"하이면"
,"하일면"
,"회화면"
 };
    public string[] d4 = new string[] { "내외동"
,"대동면"
,"동상동"
,"부원동"
,"북부동"
,"불암동"
,"삼안동"
,"상동면"
,"생림면"
,"장유1동"
,"장유2동"
,"장유3동"
,"주촌면"
,"진례면"
,"진영읍"
,"칠산서부동"
,"한림면"
,"활천동"
,"회현동"
};
    public string[] d5 = new string[] { "고현면"
,"남면"
,"남해읍"
,"미조면"
,"삼동면"
,"상주면"
,"서면"
,"설천면"
,"이동면"
,"창선면"
};
    public string[] d6 = new string[] {"가곡동"
,"교동"
,"내이동"
,"내일동"
,"단장면"
,"무안면"
,"부북면"
,"산내면"
,"산외면"
,"삼랑진읍"
,"삼문동"
,"상남면"
,"상동면"
,"청도면"
,"초동면"
,"하남읍"
 };
    public string[] d7 = new string[] {"곤명면"
,"곤양면"
,"남양동"
,"동서금동"
,"동서동"
,"벌용동"
,"사남면"
,"사천읍"
,"서포면"
,"선구동"
,"용현면"
,"정동면"
,"축동면"
,"향촌동"
 };
    public string[] d8 = new string[] {"금서면"
,"단성면"
,"산청읍"
,"삼장면"
,"생비량면"
,"생초면"
,"시천면"
,"신등면"
,"신안면"
,"오부면"
,"차황면"
 };
    public string[] d9 = new string[] {"강서동"
,"덕계동"
,"동면"
,"물금읍"
,"삼성동"
,"상북면"
,"서창동"
,"소주동"
,"양주동"
,"원동면"
,"중앙동"
,"평산동"
,"하북면"
 };
    public string[] dd1 = new string[] {"가례면"
,"궁류면"
,"낙서면"
,"대의면"
,"봉수면"
,"부림면"
,"용덕면"
,"유곡면"
,"의령읍"
,"정곡면"
,"지정면"
,"칠곡면"
,"화정면"
 };
    public string[] dd2 = new string[] { "가호동"
,"금곡면"
,"금산면"
,"내동면"
,"대곡면"
,"대평면"
,"명석면"
,"문산읍"
,"미천면"
,"사봉면"
,"상대동"
,"상봉동"
,"상평동"
,"성북동"
,"수곡면"
,"신안동"
,"이반성면"
,"이현동"
,"일반성면"
,"정촌면"
,"중앙동"
,"지수면"
,"진성면"
,"집현면"
,"천전동"
,"초장동"
,"충무공동"
,"판문동"
,"평거동"
,"하대동"
};
    public string[] dd3 = new string[] {"계성면"
,"고암면"
,"길곡면"
,"남지읍"
,"대지면"
,"대합면"
,"도천면"
,"부곡면"
,"성산면"
,"영산면"
,"유어면"
,"이방면"
,"장마면"
,"창녕읍"
 };
    public string[] dd4 = new string[] { "가포동"
,"교방동"
,"구산면"
,"문화동"
,"산호동"
,"오동동"
,"완월동"
,"월영동"
,"자산동"
,"중앙동"
,"진동면"
,"진북면"
,"진전면"
,"합포동"
,"현동"
};
    public string[] dd5 = new string[] {"구암1동"
,"구암2동"
,"내서읍"
,"봉암동"
,"석전동"
,"양덕1동"
,"양덕2동"
,"합성1동"
,"합성2동"
,"회성동"
,"회원1동"
,"회원2동"
 };
    public string[] dd6 = new string[] {"가음정동"
,"반송동"
,"사파동"
,"상남동"
,"성주동"
,"용지동"
,"웅남동"
,"중앙동"
 };
    public string[] dd7 = new string[] {"대산면"
,"동읍"
,"명곡동"
,"봉림동"
,"북면"
,"의창동"
,"팔룡동"
 };
    public string[] dd8 = new string[] {"경화동"
,"덕산동"
,"병암동"
,"석동"
,"여좌동"
,"웅동1동"
,"웅동2동"
,"웅천동"
,"이동"
,"자은동"
,"충무동"
,"태백동"
,"풍호동"
 };
    public string[] dd9 = new string[] {"광도면"
,"도산면"
,"도천동"
,"명정동"
,"무전동"
,"미수동"
,"봉평동"
,"북신동"
,"사량면"
,"산양읍"
,"욕지면"
,"용남면"
,"정량동"
,"중앙동"
,"한산면"
 };
    public string[] ddd1 = new string[] {"고전면"
,"금남면"
,"금성면"
,"북천면"
,"악양면"
,"양보면"
,"옥종면"
,"적량면"
,"진교면"
,"청암면"
,"하동읍"
,"화개면"
,"횡천면"
 };
    public string[] ddd2 = new string[] { "가야읍"
,"군북면"
,"대산면"
,"법수면"
,"산인면"
,"여항면"
,"칠북면"
,"칠서면"
,"칠원읍"
,"함안면"
};
    public string[] ddd3 = new string[] { "마천면"
,"백전면"
,"병곡면"
,"서상면"
,"서하면"
,"수동면"
,"안의면"
,"유림면"
,"지곡면"
,"함양읍"
,"휴천면"
};
    public string[] ddd4 = new string[] {"가야면"
,"가회면"
,"대병면"
,"대양면"
,"덕곡면"
,"묘산면"
,"봉산면"
,"삼가면"
,"쌍백면"
,"쌍책면"
,"야로면"
,"용주면"
,"율곡면"
,"적중면"
,"청덕면"
,"초계면"
,"합천읍" };
    //경상북도
    public string[] e1 = new string[] {"남부동"
,"남산면"
,"남천면"
,"동부동"
,"북부동"
,"서부동"
,"서부동"
,"압량읍"
,"와촌면"
,"용성면"
,"자인면"
,"중방동"
,"중앙동"
,"진량읍"
,"하양읍"
 };
    public string[] e2 = new string[] {"감포읍"
,"강동면"
,"건천읍"
,"내남면"
,"동천동"
,"문무대왕면"
,"보덕동"
,"불국동"
,"산내면"
,"서면"
,"선도동"
,"성건동"
,"안강읍"
,"양남면"
,"외동읍"
,"용강동"
,"월성동"
,"중부동"
,"천북면"
,"현곡면"
,"황남동"
,"황성동"
,"황오동"
 };
    public string[] e3 = new string[] { "개진면"
,"다산면"
,"대가야읍"
,"덕곡면"
,"성산면"
,"쌍림면"
,"우곡면"
,"운수면"
};
    public string[] e4 = new string[] { "고아읍"
,"공단동"
,"광평동"
,"도개면"
,"도량동"
,"무을면"
,"비산동"
,"산동읍"
,"상모사곡동"
,"선산읍"
,"선주원남동"
,"송정동"
,"신평1동"
,"신평2동"
,"양포동"
,"옥성면"
,"원평동"
,"인동동"
,"임오동"
,"장천면"
,"지산동"
,"진미동"
,"해평면"
,"형곡1동"
,"형곡2동"
};
    public string[] e5 = new string[] {"군위읍"
,"부계면"
,"산성면"
,"삼국유사면"
,"소보면"
,"우보면"
,"의흥면"
,"효령면"
};
    public string[] e6 = new string[] {"감문면"
,"감천면"
,"개령면"
,"구성면"
,"남면"
,"농소면"
,"대곡동"
,"대덕면"
,"대신동"
,"대항면"
,"봉산면"
,"부항면"
,"아포읍"
,"양금동"
,"어모면"
,"율곡동"
,"자산동"
,"조마면"
,"증산면"
,"지례면"
,"지좌동"
,"평화남산동"
 };
    public string[] e7 = new string[] { "가은읍"
,"농암면"
,"동로면"
,"마성면"
,"문경읍"
,"산북면"
,"산양면"
,"영순면"
,"점촌1동"
,"점촌2동"
,"점촌3동"
,"점촌4동"
,"점촌5동"
,"호계면"
    };
    public string[] e8 = new string[] {"명호면"
,"물야면"
,"법전면"
,"봉성면"
,"봉화읍"
,"상운면"
,"석포면"
,"소천면"
,"재산면"
,"춘양면"
};
    public string[] e9 = new string[] {"계림동"
,"공검면"
,"공성면"
,"낙동면"
,"남원동"
,"내서면"
,"동문동"
,"동성동"
,"모동면"
,"모서면"
,"북문동"
,"사벌국면"
,"신흥동"
,"외남면"
,"외서면"
,"은척면"
,"이안면"
,"중동면"
,"청리면"
,"함창읍"
,"화남면"
,"화동면"
,"화북면"
,"화서면"
  };
    public string[] ee1 = new string[] {"가천면"
,"금수면"
,"대가면"
,"벽진면"
,"선남면"
,"성주읍"
,"수륜면"
,"용암면"
,"월항면"
,"초전면"
 };
    public string[] ee2 = new string[] {"강남동"
,"길안면"
,"남선면"
,"남후면"
,"녹전면"
,"도산면"
,"명륜동"
,"북후면"
,"서구동"
,"서후면"
,"송하동"
,"안기동"
,"예안면"
,"옥동"
,"와룡면"
,"용상동"
,"일직면"
,"임동면"
,"임하면"
,"중구동"
,"태화동"
,"평화동"
,"풍산읍"
,"풍천면"
 };
    public string[] ee3 = new string[] {"강구면"
,"남정면"
,"달산면"
,"병곡면"
,"영덕읍"
,"영해면"
,"지품면"
,"창수면"
,"축산면"
 };
    public string[] ee4 = new string[] {"석보면"
,"수비면"
,"영양읍"
,"일월면"
,"입암면"
,"청기면"
 };
    public string[] ee5 = new string[] {"가흥1동"
,"가흥2동"
,"단산면"
,"문수면"
,"봉현면"
,"부석면"
,"상망동"
,"순흥면"
,"안정면"
,"영주1동"
,"영주2동"
,"이산면"
,"장수면"
,"평은면"
,"풍기읍"
,"하망동"
,"휴천1동"
,"휴천2동"
,"휴천3동"
    };
    public string[] ee6 = new string[] { "고경면"
,"금호읍"
,"남부동"
,"대창면"
,"동부동"
,"북안면"
,"서부동"
,"신녕면"
,"완산동"
,"임고면"
,"자양면"
,"중앙동"
,"청통면"
,"화남면"
,"화북면"
,"화산면"
 };
    public string[] ee7 = new string[] {"감천면"
,"개포면"
,"보문면"
,"예천읍"
,"용궁면"
,"용문면"
,"유천면"
,"은풍면"
,"지보면"
,"풍양면"
,"호명면"
,"효자면"
 };
    public string[] ee8 = new string[] {"독도"
,"북면"
,"서면"
,"울릉읍"
 };
    public string[] ee9 = new string[] {"근남면"
,"금강송면"
,"기성면"
,"매화면"
,"북면"
,"온정면"
,"울진읍"
,"죽변면"
,"평해읍"
,"후포면"
 };
    public string[] eee1 = new string[] {"가음면"
,"구천면"
,"금성면"
,"다인면"
,"단밀면"
,"단북면"
,"단촌면"
,"봉양면"
,"비안면"
,"사곡면"
,"신평면"
,"안계면"
,"안사면"
,"안평면"
,"옥산면"
,"의성읍"
,"점곡면"
,"춘산면"
 };
    public string[] eee2 = new string[] {"각남면"
,"각북면"
,"금천면"
,"매전면"
,"운문면"
,"이서면"
,"청도읍"
,"풍각면"
,"화양읍"
 };
    public string[] eee3 = new string[] {"부남면"
,"안덕면"
,"주왕산면"
,"진보면"
,"청송읍"
,"파천면"
,"현동면"
,"현서면"
 };
    public string[] eee4 = new string[] {"가산면"
,"기산면"
,"동명면"
,"북삼읍"
,"석적읍"
,"약목면"
,"왜관읍"
,"지천면"
 };
    public string[] eee5 = new string[] {"구룡포읍"
,"대송면"
,"대이동"
,"동해면"
,"상대동"
,"송도동"
,"연일읍"
,"오천읍"
,"장기면"
,"제철동"
,"청림동"
,"해도동"
,"호미곶면"
,"효곡동"
 };
    public string[] eee6 = new string[] {"기계면"
,"기북면"
,"두호동"
,"송라면"
,"신광면"
,"양학동"
,"용흥동"
,"우창동"
,"장량동"
,"죽도동"
,"죽장면"
,"중앙동"
,"청하면"
,"환여동"
,"흥해읍" };
    //광주광역시
    public string[] ff1 = new string[] { "도산동"
,"동곡동"
,"본량동"
,"비아동"
,"삼도동"
,"송정1동"
,"송정2동"
,"수완동"
,"신가동"
,"신창동"
,"신흥동"
,"어룡동"
,"우산동"
,"운남동"
,"월곡1동"
,"월곡2동"
,"임곡동"
,"첨단1동"
,"첨단2동"
,"평동"
,"하남동"
};
    public string[] ff2 = new string[] { "대촌동"
,"방림1동"
,"방림2동"
,"백운1동"
,"백운2동"
,"봉선1동"
,"봉선2동"
,"사직동"
,"송암동"
,"양림동"
,"월산4동"
,"월산5동"
,"월산동"
,"주월1동"
,"주월2동"
,"진월동"
,"효덕동"
};
    public string[] ff3 = new string[] {"계림1동"
,"계림2동"
,"동명동"
,"산수1동"
,"산수2동"
,"서남동"
,"지산1동"
,"지산2동"
,"지원1동"
,"지원2동"
,"충장동"
,"학동"
,"학운동"
 };
    public string[] ff4 = new string[] {"건국동"
,"동림동"
,"두암1동"
,"두암2동"
,"두암3동"
,"매곡동"
,"문화동"
,"문흥1동"
,"문흥2동"
,"삼각동"
,"석곡동"
,"신안동"
,"신용동"
,"양산동"
,"오치1동"
,"오치2동"
,"용봉동"
,"우산동"
,"운암1동"
,"운암2동"
,"운암3동"
,"일곡동"
,"임동"
,"중앙동"
,"중흥1동"
,"중흥2동"
,"중흥3동"
,"풍향동"
 };
    public string[] ff5 = new string[] { "광천동"
,"금호1동"
,"금호2동"
,"농성1동"
,"농성2동"
,"동천동"
,"상무1동"
,"상무2동"
,"서창동"
,"양3동"
,"양동"
,"유덕동"
,"치평동"
,"풍암동"
,"화정1동"
,"화정2동"
,"화정3동"
,"화정4동"};
    //대구광역시
    public string[] g1 = new string[] { "대명10동"
,"대명11동"
,"대명1동"
,"대명2동"
,"대명3동"
,"대명4동"
,"대명5동"
,"대명6동"
,"대명9동"
,"봉덕1동"
,"봉덕2동"
,"봉덕3동"
,"이천동"
};
    public string[] g2 = new string[] {"감삼동"
,"도원동"
,"두류1.2동"
,"두류3동"
,"본동"
,"본리동"
,"상인1동"
,"상인2동"
,"상인3동"
,"성당동"
,"송현1동"
,"송현2동"
,"신당동"
,"용산1동"
,"용산2동"
,"월성1동"
,"월성2동"
,"이곡1동"
,"이곡2동"
,"장기동"
,"죽전동"
,"진천동"
 };
    public string[] g3 = new string[] {"가창면"
,"구지면"
,"논공읍"
,"다사읍"
,"옥포읍"
,"유가읍"
,"하빈면"
,"현풍읍"
,"화원읍"
 };
    public string[] g4 = new string[] {"공산동"
,"도평동"
,"동촌동"
,"방촌동"
,"불로.봉무동"
,"신암1동"
,"신암2동"
,"신암3동"
,"신암4동"
,"신암5동"
,"신천1.2동"
,"신천3동"
,"신천4동"
,"안심1동"
,"안심2동"
,"안심3동"
,"안심4동"
,"지저동"
,"해안동"
,"혁신동"
,"효목1동"
,"효목2동"
 };
    public string[] g5 = new string[] {"검단동"
,"고성동"
,"관문동"
,"관음동"
,"구암동"
,"국우동"
,"노원동"
,"대현동"
,"동천동"
,"무태조야동"
,"복현1동"
,"복현2동"
,"산격1동"
,"산격2동"
,"산격3동"
,"산격4동"
,"읍내동"
,"칠성동"
,"침산1동"
,"침산2동"
,"침산3동"
,"태전1동"
,"태전2동"
 };
    public string[] g6 = new string[] { "내당1동"
,"내당2.3동"
,"내당4동"
,"비산1동"
,"비산2.3동"
,"비산4동"
,"비산5동"
,"비산6동"
,"비산7동"
,"상중이동"
,"원대동"
,"평리1동"
,"평리2동"
,"평리3동"
,"평리4동"
,"평리5동"
,"평리6동"
};
    public string[] g7 = new string[] { "고산1동"
,"고산2동"
,"고산3동"
,"두산동"
,"만촌1동"
,"만촌2동"
,"만촌3동"
,"범물1동"
,"범물2동"
,"범어1동"
,"범어2동"
,"범어3동"
,"범어4동"
,"상동"
,"수성1가동"
,"수성2.3가동"
,"수성4가동"
,"중동"
,"지산1동"
,"지산2동"
,"파동"
,"황금1동"
,"황금2동"
};
    public string[] g8 = new string[] {"남산1동"
,"남산2동"
,"남산3동"
,"남산4동"
,"대봉1동"
,"대봉2동"
,"대신동"
,"동인동"
,"삼덕동"
,"성내1동"
,"성내2동"
,"성내3동" };
    //대전광역시
    public string[] h1 = new string[] { "대화동"
,"덕암동"
,"목상동"
,"법1동"
,"법2동"
,"비래동"
,"석봉동"
,"송촌동"
,"신탄진동"
,"오정동"
,"중리동"
,"회덕동"
};
    public string[] h2 = new string[] {"가양1동"
,"가양2동"
,"대동"
,"대청동"
,"산내동"
,"삼성동"
,"성남동"
,"신인동"
,"용운동"
,"용전동"
,"자양동"
,"중앙동"
,"판암1동"
,"판암2동"
,"홍도동"
,"효동"
 };
    public string[] h3 = new string[] {"가수원동"
,"가장동"
,"갈마1동"
,"갈마2동"
,"관저1동"
,"관저2동"
,"괴정동"
,"기성동"
,"내동"
,"도마1동"
,"도마2동"
,"둔산1동"
,"둔산2동"
,"둔산3동"
,"만년동"
,"변동"
,"복수동"
,"용문동"
,"월평1동"
,"월평2동"
,"월평3동"
,"정림동"
,"탄방동"
 };
    public string[] h4 = new string[] {"관평동"
,"구즉동"
,"노은1동"
,"노은2동"
,"노은3동"
,"신성동"
,"온천1동"
,"온천2동"
,"원신흥동"
,"전민동"
,"진잠동"
 };
    public string[] h5 = new string[] {"대사동"
,"대흥동"
,"목동"
,"문창동"
,"문화1동"
,"문화2동"
,"부사동"
,"산성동"
,"석교동"
,"오류동"
,"용두동"
,"유천1동"
,"유천2동"
,"은행선화동"
,"중촌동"
,"태평1동"
,"태평2동" };
    //부산광역시
    public string[] i1 = new string[] {  "가덕도동"
,"가락동"
,"강동동"
,"녹산동"
,"대저1동"
,"대저2동"
,"명지1동"
,"명지2동"
};
    public string[] i2 = new string[] {"구서제1동"
,"구서제2동"
,"금사회동동"
,"금성동"
,"남산동"
,"부곡제1동"
,"부곡제2동"
,"부곡제3동"
,"부곡제4동"
,"서제1동"
,"서제2동"
,"서제3동"
,"선두구동"
,"장전제1동"
,"장전제2동"
,"청룡노포동"
    };
    public string[] i3 = new string[] { "기장읍"
,"일광면"
,"장안읍"
,"정관읍"
,"철마면"
 };
    public string[] i4 = new string[] {"감만제1동"
,"감만제2동"
,"대연제1동"
,"대연제3동"
,"대연제4동"
,"대연제5동"
,"대연제6동"
,"문현제1동"
,"문현제2동"
,"문현제3동"
,"문현제4동"
,"용당동"
,"용호제1동"
,"용호제2동"
,"용호제3동"
,"용호제4동"
,"우암동"
 };
    public string[] i5 = new string[] { "범일제1동"
,"범일제2동"
,"범일제5동"
,"수정제1동"
,"수정제2동"
,"수정제4동"
,"수정제5동"
,"좌천동"
,"초량제1동"
,"초량제2동"
,"초량제3동"
,"초량제6동"
};
    public string[] i6 = new string[] {"명륜동"
,"명장제1동"
,"명장제2동"
,"복산동"
,"사직제1동"
,"사직제2동"
,"사직제3동"
,"수민동"
,"안락제1동"
,"안락제2동"
,"온천제1동"
,"온천제2동"
,"온천제3동"
 };
    public string[] i7 = new string[] {"가야제1동"
,"가야제2동"
,"개금제1동"
,"개금제2동"
,"개금제3동"
,"당감제1동"
,"당감제2동"
,"당감제4동"
,"범천제1동"
,"범천제2동"
,"부암제1동"
,"부암제3동"
,"부전제1동"
,"부전제2동"
,"양정제1동"
,"양정제2동"
,"연지동"
,"전포제1동"
,"전포제2동"
,"초읍동"
 };
    public string[] i8 = new string[] {"구포제1동"
,"구포제2동"
,"구포제3동"
,"금곡동"
,"덕천제1동"
,"덕천제2동"
,"덕천제3동"
,"만덕제1동"
,"만덕제2동"
,"만덕제3동"
,"화명제1동"
,"화명제2동"
,"화명제3동"
 };
    public string[] i9 = new string[] {"감전동"
,"괘법동"
,"덕포제1동"
,"덕포제2동"
,"모라제1동"
,"모라제3동"
,"삼락동"
,"엄궁동"
,"주례제1동"
,"주례제2동"
,"주례제3동"
,"학장동"
 };
    public string[] ii1 = new string[] {"감천제1동"
,"감천제2동"
,"괴정제1동"
,"괴정제2동"
,"괴정제3동"
,"괴정제4동"
,"구평동"
,"다대제1동"
,"다대제2동"
,"당리동"
,"신평제1동"
,"신평제2동"
,"장림제1동"
,"장림제2동"
,"하단제1동"
,"하단제2동"
 };
    public string[] ii2 = new string[] {"남부민제1동"
,"남부민제2동"
,"동대신제1동"
,"동대신제2동"
,"동대신제3동"
,"부민동"
,"서대신제1동"
,"서대신제3동"
,"서대신제4동"
,"아미동"
,"암남동"
,"초장동"
,"충무동"
 };
    public string[] ii3 = new string[] {"광안제1동"
,"광안제2동"
,"광안제3동"
,"광안제4동"
,"남천제1동"
,"남천제2동"
,"망미제1동"
,"망미제2동"
,"민락동"
,"수영동"
 };
    public string[] ii4 = new string[] { "거제제1동"
,"거제제2동"
,"거제제3동"
,"거제제4동"
,"연산제1동"
,"연산제2동"
,"연산제3동"
,"연산제4동"
,"연산제5동"
,"연산제6동"
,"연산제8동"
,"연산제9동"
};
    public string[] ii5 = new string[] { "남항동"
,"동삼제1동"
,"동삼제2동"
,"동삼제3동"
,"봉래제1동"
,"봉래제2동"
,"신선동"
,"영선제1동"
,"영선제2동"
,"청학제1동"
,"청학제2동"
};
    public string[] ii6 = new string[] {"광복동"
,"남포동"
,"대청동"
,"동광동"
,"보수동"
,"부평동"
,"영주제1동"
,"영주제2동"
,"중앙동"
 };
    public string[] ii7 = new string[] {"반송제1동"
,"반송제2동"
,"반여제1동"
,"반여제2동"
,"반여제3동"
,"반여제4동"
,"송정동"
,"우제1동"
,"우제2동"
,"우제3동"
,"재송제1동"
,"재송제2동"
,"좌제1동"
,"좌제2동"
,"좌제3동"
,"좌제4동"
,"중제1동"
,"중제2동" };
    //세종특별자치시
    public string[] j1 = new string[] {"고운동"
,"금남면"
,"다정동"
,"대평동"
,"도담동"
,"보람동"
,"부강면"
,"새롬동"
,"소담동"
,"소정면"
,"아름동"
,"연기면"
,"연동면"
,"연서면"
,"장군면"
,"전동면"
,"전의면"
,"조치원읍"
,"종촌동"
,"한솔동"
,"해밀동"
 };
    //울산광역시
    public string[] k1 = new string[] {"달동"
,"대현동"
,"무거동"
,"삼산동"
,"삼호동"
,"선암동"
,"수암동"
,"신정1동"
,"신정2동"
,"신정3동"
,"신정4동"
,"신정5동"
,"야음장생포동"
,"옥동"

 };
    public string[] k2 = new string[] { "남목1동"
,"남목2동"
,"남목3동"
,"대송동"
,"방어동"
,"일산동"
,"전하1동"
,"전하2동"
,"화정동"
};
    public string[] k3 = new string[] { "강동동"
,"농소1동"
,"농소2동"
,"농소3동"
,"송정동"
,"양정동"
,"염포동"
,"효문동"
};
    public string[] k4 = new string[] {"두동면"
,"두서면"
,"범서읍"
,"삼남읍"
,"삼동면"
,"상북면"
,"서생면"
,"언양읍"
,"온산읍"
,"온양읍"
,"웅촌면"
,"청량읍"
 };
    public string[] k5 = new string[] { "다운동"
,"반구1동"
,"반구2동"
,"병영1동"
,"병영2동"
,"복산1동"
,"복산2동"
,"성안동"
,"약사동"
,"우정동"
,"중앙동"
,"태화동"
,"학성동"};
    //인천광역시
    public string[] l1 = new string[] {"강화읍"
,"교동면"
,"길상면"
,"내가면"
,"불은면"
,"삼산면"
,"서도면"
,"선원면"
,"송해면"
,"양도면"
,"양사면"
,"하점면"
,"화도면"
 };
    public string[] l2 = new string[] {"계산1동"
,"계산2동"
,"계산3동"
,"계산4동"
,"계양1동"
,"계양2동"
,"계양3동"
,"작전1동"
,"작전2동"
,"작전서운동"
,"효성1동"
,"효성2동"
 };
    public string[] l3 = new string[] {"간석1동"
,"간석2동"
,"간석3동"
,"간석4동"
,"구월1동"
,"구월2동"
,"구월3동"
,"구월4동"
,"남촌도림동"
,"논현1동"
,"논현2동"
,"논현고잔동"
,"만수1동"
,"만수2동"
,"만수3동"
,"만수4동"
,"만수5동"
,"만수6동"
,"서창2동"
,"장수서창동"
 };
    public string[] l4 = new string[] {"금창동"
,"만석동"
,"송림1동"
,"송림2동"
,"송림3.5동"
,"송림4동"
,"송림6동"
,"송현1.2동"
,"송현3동"
,"화수1.화평동"
,"화수2동"
 };
    public string[] l5 = new string[] {"관교동"
,"도화1동"
,"도화2,3동"
,"문학동"
,"숭의1,3동"
,"숭의2동"
,"숭의4동"
,"용현1,4동"
,"용현2동"
,"용현3동"
,"용현5동"
,"주안1동"
,"주안2동"
,"주안3동"
,"주안4동"
,"주안5동"
,"주안6동"
,"주안7동"
,"주안8동"
,"학익1동"
,"학익2동"
 };
    public string[] l6 = new string[] {"갈산1동"
,"갈산2동"
,"부개1동"
,"부개2동"
,"부개3동"
,"부평1동"
,"부평2동"
,"부평3동"
,"부평4동"
,"부평5동"
,"부평6동"
,"산곡1동"
,"산곡2동"
,"산곡3동"
,"산곡4동"
,"삼산1동"
,"삼산2동"
,"십정1동"
,"십정2동"
,"일신동"
,"청천1동"
,"청천2동"
 };
    public string[] l7 = new string[] {"가정1동"
,"가정2동"
,"가정3동"
,"가좌1동"
,"가좌2동"
,"가좌3동"
,"가좌4동"
,"검단동"
,"검암경서동"
,"당하동"
,"마전동"
,"불로대곡동"
,"석남1동"
,"석남2동"
,"석남3동"
,"신현원창동"
,"아라동"
,"연희동"
,"오류왕길동"
,"원당동"
,"청라1동"
,"청라2동"
,"청라3동"
 };
    public string[] l8 = new string[] {"동춘1동"
,"동춘2동"
,"동춘3동"
,"선학동"
,"송도1동"
,"송도2동"
,"송도3동"
,"송도4동"
,"송도5동"
,"연수1동"
,"연수2동"
,"연수3동"
,"옥련1동"
,"옥련2동"
,"청학동"
 };
    public string[] l9 = new string[] { "대청면"
,"덕적면"
,"백령면"
,"북도면"
,"연평면"
,"영흥면"
,"자월면"
};
    public string[] ll1 = new string[] {"개항동"
,"도원동"
,"동인천동"
,"신포동"
,"신흥동"
,"연안동"
,"영종1동"
,"영종동"
,"용유동"
,"운서동"
,"율목동" };
    //전라남도
    public string[] mn1 = new string[] { "강진읍"
,"군동면"
,"대구면"
,"도암면"
,"마량면"
,"병영면"
,"성전면"
,"신전면"
,"옴천면"
,"작천면"
,"칠량면"
};
    public string[] mn2 = new string[] { "고흥읍"
,"과역면"
,"금산면"
,"남양면"
,"대서면"
,"도덕면"
,"도양읍"
,"도화면"
,"동강면"
,"동일면"
,"두원면"
,"봉래면"
,"영남면"
,"점암면"
,"포두면"
,"풍양면"
};
    public string[] mn3 = new string[] { "겸면"
,"고달면"
,"곡성읍"
,"목사동면"
,"삼기면"
,"석곡면"
,"오곡면"
,"오산면"
,"옥과면"
,"입면"
,"죽곡면"
};
    public string[] mn4 = new string[] { "골약동"
,"광양읍"
,"광영동"
,"금호동"
,"다압면"
,"봉강면"
,"옥곡면"
,"옥룡면"
,"중마동"
,"진상면"
,"진월면"
,"태인동"
};
    public string[] mn5 = new string[] {"간전면"
,"광의면"
,"구례읍"
,"마산면"
,"문척면"
,"산동면"
,"용방면"
,"토지면"
 };
    public string[] mn6 = new string[] { "공산면"
,"금남동"
,"금천면"
,"남평읍"
,"노안면"
,"다도면"
,"다시면"
,"동강면"
,"문평면"
,"반남면"
,"봉황면"
,"빛가람동"
,"산포면"
,"성북동"
,"세지면"
,"송월동"
,"영강동"
,"영산동"
,"왕곡면"
,"이창동"
};
    public string[] mn7 = new string[] {"가사문학면"
,"고서면"
,"금성면"
,"담양읍"
,"대덕면"
,"대전면"
,"무정면"
,"봉산면"
,"수북면"
,"용면"
,"월산면"
,"창평면"
 };
    public string[] mn8 = new string[] { "대성동"
,"동명동"
,"만호동"
,"목원동"
,"부주동"
,"부흥동"
,"북항동"
,"산정동"
,"삼학동"
,"삼향동"
,"상동"
,"신흥동"
,"연동"
,"연산동"
,"옥암동"
,"용당1동"
,"용당2동"
,"용해동"
,"원산동"
,"유달동"
,"이로동"
,"죽교동"
,"하당동"
};
    public string[] mn9 = new string[] {"망운면"
,"몽탄면"
,"무안읍"
,"삼향읍"
,"운남면"
,"일로읍"
,"청계면"
,"해제면"
,"현경면"
 };
    public string[] mmn1 = new string[] {"겸백면"
,"노동면"
,"득량면"
,"문덕면"
,"미력면"
,"벌교읍"
,"보성읍"
,"복내면"
,"웅치면"
,"율어면"
,"조성면"
,"회천면"
 };
    public string[] mmn2 = new string[] { "낙안면"
,"남제동"
,"덕연동"
,"도사동"
,"매곡동"
,"별량면"
,"삼산동"
,"상사면"
,"서면"
,"송광면"
,"승주읍"
,"왕조1동"
,"왕조2동"
,"외서면"
,"월등면"
,"장천동"
,"저전동"
,"조곡동"
,"주암면"
,"중앙동"
,"풍덕동"
,"해룡면"
,"향동"
,"황전면"
};
    public string[] mmn3 = new string[] {"도초면"
,"비금면"
,"신의면"
,"안좌면"
,"암태면"
,"압해읍"
,"임자면"
,"자은면"
,"장산면"
,"증도면"
,"지도읍"
,"팔금면"
,"하의면"
,"흑산면"
 };
    public string[] mmn4 = new string[] { "광림동"
,"국동"
,"남면"
,"대교동"
,"돌산읍"
,"동문동"
,"둔덕동"
,"만덕동"
,"묘도동"
,"문수동"
,"미평동"
,"삼산면"
,"삼일동"
,"서강동"
,"소라면"
,"시전동"
,"쌍봉동"
,"여서동"
,"여천동"
,"월호동"
,"율촌면"
,"주삼동"
,"중앙동"
,"충무동"
,"한려동"
,"화양면"
,"화정면"
};
    public string[] mmn5 = new string[] {"군남면"
,"군서면"
,"낙월면"
,"대마면"
,"묘량면"
,"백수읍"
,"법성면"
,"불갑면"
,"염산면"
,"영광읍"
,"홍농읍"
 };
    public string[] mmn6 = new string[] { "군서면"
,"금정면"
,"덕진면"
,"도포면"
,"미암면"
,"삼호읍"
,"서호면"
,"시종면"
,"신북면"
,"영암읍"
,"학산면"
    };
    public string[] mmn7 = new string[] {"고금면"
,"군외면"
,"금당면"
,"금일읍"
,"노화읍"
,"보길면"
,"생일면"
,"소안면"
,"신지면"
,"약산면"
,"완도읍"
,"청산면"
};
    public string[] mmn8 = new string[] { "남면"
,"동화면"
,"북이면"
,"북일면"
,"북하면"
,"삼계면"
,"삼서면"
,"서삼면"
,"장성읍"
,"진원면"
,"황룡면"
};
    public string[] mmn9 = new string[] {"관산읍"
,"대덕읍"
,"부산면"
,"안양면"
,"용산면"
,"유치면"
,"장동면"
,"장평면"
,"장흥읍"
,"회진면"
 };
    public string[] mmmn1 = new string[] { "고군면"
,"군내면"
,"의신면"
,"임회면"
,"조도면"
,"지산면"
,"진도읍"
};
    public string[] mmmn2 = new string[] {"나산면"
,"대동면"
,"손불면"
,"신광면"
,"엄다면"
,"월야면"
,"학교면"
,"함평읍"
,"해보면"
 };
    public string[] mmmn3 = new string[] {"계곡면"
,"마산면"
,"문내면"
,"북일면"
,"북평면"
,"산이면"
,"삼산면"
,"송지면"
,"옥천면"
,"해남읍"
,"현산면"
,"화산면"
,"화원면"
,"황산면"
 };
    public string[] mmmn4 = new string[] {"능주면"
,"도곡면"
,"도암면"
,"동면"
,"동복면"
,"백아면"
,"사평면"
,"이서면"
,"이양면"
,"청풍면"
,"춘양면"
,"한천면"
,"화순읍" };
    //전라북도
    public string[] n1 = new string[] {"고수면"
,"고창읍"
,"공음면"
,"대산면"
,"무장면"
,"부안면"
,"상하면"
,"성내면"
,"성송면"
,"신림면"
,"심원면"
,"아산면"
,"해리면"
,"흥덕면"
 };
    public string[] n2 = new string[] { "개정동"
,"개정면"
,"경암동"
,"구암동"
,"나운1동"
,"나운2동"
,"나운3동"
,"나포면"
,"대야면"
,"미성동"
,"삼학동"
,"서수면"
,"성산면"
,"소룡동"
,"수송동"
,"신풍동"
,"옥구읍"
,"옥도면"
,"옥산면"
,"옥서면"
,"월명동"
,"임피면"
,"조촌동"
,"중앙동"
,"해신동"
,"회현면"
,"흥남동"
};
    public string[] n3 = new string[] {"검산동"
,"공덕면"
,"광활면"
,"교월동"
,"금구면"
,"금산면"
,"만경읍"
,"백구면"
,"백산면"
,"봉남면"
,"부량면"
,"성덕면"
,"신풍동"
,"요촌동"
,"용지면"
,"죽산면"
,"진봉면"
,"청하면"
,"황산면"
 };
    public string[] n4 = new string[] {"금동"
,"금지면"
,"노암동"
,"대강면"
,"대산면"
,"덕과면"
,"도통동"
,"동충동"
,"보절면"
,"사매면"
,"산내면"
,"산동면"
,"송동면"
,"수지면"
,"아영면"
,"왕정동"
,"운봉읍"
,"이백면"
,"인월면"
,"주생면"
,"주천면"
,"죽항동"
,"향교동"
 };
    public string[] n5 = new string[] {"무주읍"
,"무풍면"
,"부남면"
,"설천면"
,"안성면"
,"적상면"
 };
    public string[] n6 = new string[] { "계화면"
,"동진면"
,"백산면"
,"변산면"
,"보안면"
,"부안읍"
,"상서면"
,"위도면"
,"주산면"
,"줄포면"
,"진서면"
,"하서면"
,"행안면"
};
    public string[] n7 = new string[] {"구림면"
,"금과면"
,"동계면"
,"복흥면"
,"순창읍"
,"쌍치면"
,"유등면"
,"인계면"
,"적성면"
,"팔덕면"
,"풍산면"
 };
    public string[] n8 = new string[] { "경천면"
,"고산면"
,"구이면"
,"동상면"
,"봉동읍"
,"비봉면"
,"삼례읍"
,"상관면"
,"소양면"
,"용진읍"
,"운주면"
,"이서면"
,"화산면"
};
    public string[] n9 = new string[] { "금마면"
,"남중동"
,"낭산면"
,"동산동"
,"마동"
,"망성면"
,"모현동"
,"삼기면"
,"삼성동"
,"성당면"
,"송학동"
,"신동"
,"어양동"
,"여산면"
,"영등1동"
,"영등2동"
,"오산면"
,"왕궁면"
,"용동면"
,"용안면"
,"웅포면"
,"인화동"
,"중앙동"
,"춘포면"
,"팔봉동"
,"평화동"
,"함라면"
,"함열읍"
,"황등면"
};
    public string[] nn1 = new string[] { "강진면"
,"관촌면"
,"덕치면"
,"삼계면"
,"성수면"
,"신덕면"
,"신평면"
,"오수면"
,"운암면"
,"임실읍"
,"지사면"
,"청웅면"
};
    public string[] nn2 = new string[] {"계남면"
,"계북면"
,"번암면"
,"산서면"
,"장계면"
,"장수읍"
,"천천면"
 };
    public string[] nn3 = new string[] {"금암1동"
,"금암2동"
,"덕진동"
,"송천1동"
,"송천2동"
,"여의동"
,"우아1동"
,"우아2동"
,"인후1동"
,"인후2동"
,"인후3동"
,"조촌동"
,"진북동"
,"팔복동"
,"혁신동"
,"호성동"
 };
    public string[] nn4 = new string[] {"노송동"
,"동서학동"
,"삼천1동"
,"삼천2동"
,"삼천3동"
,"서서학동"
,"서신동"
,"완산동"
,"중앙동"
,"중화산1동"
,"중화산2동"
,"평화1동"
,"평화2동"
,"풍남동"
,"효자1동"
,"효자2동"
,"효자3동"
,"효자4동"
,"효자5동"
 };
    public string[] nn5 = new string[] { "감곡면"
,"고부면"
,"내장상동"
,"농소동"
,"덕천면"
,"북면"
,"산내면"
,"산외면"
,"상교동"
,"소성면"
,"수성동"
,"시기동"
,"신태인읍"
,"연지동"
,"영원면"
,"옹동면"
,"이평면"
,"입암면"
,"장명동"
,"정우면"
,"초산동"
,"칠보면"
,"태인면"
    };    
    public string[] nn6 = new string[] {"동향면"
,"마령면"
,"백운면"
,"부귀면"
,"상전면"
,"성수면"
,"안천면"
,"용담면"
,"정천면"
,"주천면"
,"진안읍"};
    //제주특별자치도
    public string[] o1 = new string[] {"남원읍"
,"대륜동"
,"대정읍마라도포함"
,"대천동"
,"동홍동"
,"서홍동"
,"성산읍"
,"송산동"
,"안덕면"
,"영천동"
,"예래동"
,"정방동"
,"중문동"
,"중앙동"
,"천지동"
,"표선면"
,"효돈동"
 };
    public string[] o2 = new string[] {"이어도"
 };
    public string[] o3 = new string[] { "건입동"
,"구좌읍"
,"노형동"
,"도두동"
,"봉개동"
,"삼도1동"
,"삼도2동"
,"삼양동"
,"아라동"
,"애월읍"
,"연동"
,"오라동"
,"외도동"
,"용담1동"
,"용담2동"
,"우도면"
,"이도1동"
,"이도2동"
,"이호동"
,"일도1동"
,"일도2동"
,"조천읍"
,"추자면"
,"한경면"
,"한림읍"
,"화북동"};
    //충청남도
    public string[] p1 = new string[] { "금암동"
,"두마면"
,"신도안면"
,"엄사면"
};
    public string[] p2 = new string[] {"계룡면"
,"금학동"
,"반포면"
,"사곡면"
,"신관동"
,"신풍면"
,"옥룡동"
,"우성면"
,"웅진동"
,"월송동"
,"유구읍"
,"의당면"
,"이인면"
,"정안면"
,"중학동"
,"탄천면"
 };
    public string[] p3 = new string[] {"군북면"
,"금산읍"
,"금성면"
,"남이면"
,"남일면"
,"복수면"
,"부리면"
,"제원면"
,"진산면"
,"추부면"
 };
    public string[] p4 = new string[] {"가야곡면"
,"강경읍"
,"광석면"
,"노성면"
,"벌곡면"
,"부적면"
,"부창동"
,"상월면"
,"성동면"
,"양촌면"
,"연무읍"
,"연산면"
,"은진면"
,"채운면"
,"취암동"
 };
    public string[] p5 = new string[] {"고대면"
,"당진1동"
,"당진2동"
,"당진3동"
,"대호지면"
,"면천면"
,"석문면"
,"송산면"
,"송악읍"
,"순성면"
,"신평면"
,"우강면"
,"정미면"
,"합덕읍"
 };
    public string[] p6 = new string[] {"남포면"
,"대천1동"
,"대천2동"
,"대천3동"
,"대천4동"
,"대천5동"
,"미산면"
,"성주면"
,"오천면"
,"웅천읍"
,"주교면"
,"주산면"
,"주포면"
,"천북면"
,"청라면"
,"청소면"
 };
    public string[] p7 = new string[] { "구룡면"
,"규암면"
,"남면"
,"내산면"
,"부여읍"
,"석성면"
,"세도면"
,"양화면"
,"옥산면"
,"외산면"
,"은산면"
,"임천면"
,"장암면"
,"초촌면"
,"충화면"
,"홍산면"
    };
    public string[] p8 = new string[] { "고북면"
,"대산읍"
,"동문1동"
,"동문2동"
,"부석면"
,"부춘동"
,"석남동"
,"성연면"
,"수석동"
,"운산면"
,"음암면"
,"인지면"
,"지곡면"
,"팔봉면"
,"해미면"
};
    public string[] p9 = new string[] { "기산면"
,"마산면"
,"마서면"
,"문산면"
,"비인면"
,"서면"
,"서천읍"
,"시초면"
,"장항읍"
,"종천면"
,"판교면"
,"한산면"
,"화양면"
};
    public string[] pp1 = new string[] { "도고면"
,"둔포면"
,"배방읍"
,"선장면"
,"송악면"
,"신창면"
,"염치읍"
,"영인면"
,"온양1동"
,"온양2동"
,"온양3동"
,"온양4동"
,"온양5동"
,"온양6동"
,"음봉면"
,"인주면"
,"탕정면"
};
    public string[] pp2 = new string[] { "고덕면"
,"광시면"
,"대술면"
,"대흥면"
,"덕산면"
,"봉산면"
,"삽교읍"
,"신암면"
,"신양면"
,"예산읍"
,"오가면"
,"응봉면"
};
    public string[] pp3 = new string[] {"광덕면"
,"동면"
,"목천읍"
,"문성동"
,"병천면"
,"봉명동"
,"북면"
,"성남면"
,"수신면"
,"신방동"
,"신안동"
,"원성1동"
,"원성2동"
,"일봉동"
,"중앙동"
,"청룡동"
,"풍세면"
 };
    public string[] pp4 = new string[] { "백석동"
,"부성1동"
,"부성2동"
,"불당동"
,"성거읍"
,"성정1동"
,"성정2동"
,"성환읍"
,"쌍용1동"
,"쌍용2동"
,"쌍용3동"
,"입장면"
,"직산읍"
};
    public string[] pp5 = new string[] {"남양면"
,"대치면"
,"목면"
,"비봉면"
,"운곡면"
,"장평면"
,"정산면"
,"청남면"
,"청양읍"
,"화성면"
 };
    public string[] pp6 = new string[] {"고남면"
,"근흥면"
,"남면"
,"소원면"
,"안면읍"
,"원북면"
,"이원면"
,"태안읍"
 };
    public string[] pp7 = new string[] { "갈산면"
,"결성면"
,"광천읍"
,"구항면"
,"금마면"
,"서부면"
,"은하면"
,"장곡면"
,"홍동면"
,"홍북읍"
,"홍성읍"};
    //충청북도
    public string[] qp1 = new string[] { "감물면"
,"괴산읍"
,"문광면"
,"불정면"
,"사리면"
,"소수면"
,"연풍면"
,"장연면"
,"청안면"
,"청천면"
,"칠성면"
};
    public string[] qp2 = new string[] { "가곡면"
,"단성면"
,"단양읍"
,"대강면"
,"매포읍"
,"어상천면"
,"영춘면"
,"적성면"
};
    public string[] qp3 = new string[] {"내북면"
,"마로면"
,"보은읍"
,"산외면"
,"삼승면"
,"속리산면"
,"수한면"
,"장안면"
,"탄부면"
,"회남면"
,"회인면"
 };
    public string[] qp4 = new string[] {"매곡면"
,"상촌면"
,"심천면"
,"양강면"
,"양산면"
,"영동읍"
,"용산면"
,"용화면"
,"추풍령면"
,"학산면"
,"황간면"
 };
    public string[] qp5 = new string[] {"군북면"
,"군서면"
,"동이면"
,"안남면"
,"안내면"
,"옥천읍"
,"이원면"
,"청산면"
,"청성면"
 };
    public string[] qp6 = new string[] {"감곡면"
,"금왕읍"
,"대소면"
,"맹동면"
,"삼성면"
,"생극면"
,"소이면"
,"원남면"
,"음성읍"
 };
    public string[] qp7 = new string[] {"교동"
,"금성면"
,"남현동"
,"덕산면"
,"백운면"
,"봉양읍"
,"송학면"
,"수산면"
,"신백동"
,"영서동"
,"용두동"
,"의림지동"
,"중앙동"
,"청전동"
,"청풍면"
,"한수면"
,"화산동"
 };
    public string[] qp8 = new string[] {"도안면"
,"증평읍"
 };
    public string[] qp9 = new string[] {"광혜원면"
,"덕산읍"
,"문백면"
,"백곡면"
,"이월면"
,"진천읍"
,"초평면"
};
    public string[] qqp1 = new string[] {"가덕면"
,"금천동"
,"남일면"
,"낭성면"
,"문의면"
,"미원면"
,"성안동"
,"영운동"
,"용담.명암.산성동"
,"용암1동"
,"용암2동"
,"중앙동"
,"탑대성동"
  };
    public string[] qqp2 = new string[] {"남이면"
,"모충동"
,"분평동"
,"사직1동"
,"사직2동"
,"사창동"
,"산남동"
,"성화.개신.죽림동"
,"수곡1동"
,"수곡2동"
,"현도면"
 };
    public string[] qqp3 = new string[] {"내덕1동"
,"내덕2동"
,"내수읍"
,"북이면"
,"오근장동"
,"오창읍"
,"우암동"
,"율량.사천동"
 };
    public string[] qqp4 = new string[] {"가경동"
,"강내면"
,"강서제1동"
,"강서제2동"
,"복대1동"
,"복대2동"
,"봉명1동"
,"봉명2.송정동"
,"오송읍"
,"옥산면"
,"운천.신봉동"
 };
    public string[] qqp5 = new string[] { "교현.안림동"
,"교현2동"
,"금가면"
,"노은면"
,"달천동"
,"대소원면"
,"동량면"
,"목행.용탄동"
,"문화동"
,"봉방동"
,"산척면"
,"살미면"
,"성내.충인동"
,"소태면"
,"수안보면"
,"신니면"
,"앙성면"
,"엄정면"
,"연수동"
,"용산동"
,"주덕읍"
,"중앙탑면"
,"지현동"
,"칠금.금릉동"
,"호암.직동"};
    //구분선
    void Start(){
        AreaTwo.captionText.text=seoul[0];
        for(int i=0;i<seoul.Length;i++){
        Dropdown.OptionData DO=new Dropdown.OptionData();
        DO.text=seoul[i];
        AreaTwo.options.Add(DO);
        }
    }
    public void OnDropdownEvent1(int index) 
    {
        switch(index){
            case 0:
            AreaTwo.options.Clear();
            AreaTwo.captionText.text=seoul[0];
            for(int i=0;i<seoul.Length;i++){
            Dropdown.OptionData DO=new Dropdown.OptionData();
            DO.text=seoul[i];
            AreaTwo.options.Add(DO);
            }
            break;
            case 1:
            AreaTwo.options.Clear();
            AreaTwo.captionText.text=busan[0];
            for(int i=0;i<busan.Length;i++){
            Dropdown.OptionData DO=new Dropdown.OptionData();
            DO.text=busan[i];
            AreaTwo.options.Add(DO);
            }
            break;
            case 2:
            AreaTwo.options.Clear();
            AreaTwo.options.Clear();
            AreaTwo.captionText.text=daegu[0];
            for(int i=0;i<daegu.Length;i++){
            Dropdown.OptionData DO=new Dropdown.OptionData();
            DO.text=daegu[i];
            AreaTwo.options.Add(DO);
            }
            break;
            case 3:
            AreaTwo.options.Clear();
            AreaTwo.captionText.text=incheon[0];
            for(int i=0;i<incheon.Length;i++){
            Dropdown.OptionData DO=new Dropdown.OptionData();
            DO.text=incheon[i];
            AreaTwo.options.Add(DO);
            }
            break;
            case 4:
            AreaTwo.options.Clear();
            AreaTwo.captionText.text=gangju[0];
            for(int i=0;i<gangju.Length;i++){
            Dropdown.OptionData DO=new Dropdown.OptionData();
            DO.text=gangju[i];
            AreaTwo.options.Add(DO);
            }
            break;
            case 5:
            AreaTwo.options.Clear();
            AreaTwo.captionText.text=daejun[0];
            for(int i=0;i<daejun.Length;i++){
            Dropdown.OptionData DO=new Dropdown.OptionData();
            DO.text=daejun[i];
            AreaTwo.options.Add(DO);
            }
            break;
            case 6:
            AreaTwo.options.Clear();
            AreaTwo.captionText.text=ulsan[0];
            for(int i=0;i<ulsan.Length;i++){
            Dropdown.OptionData DO=new Dropdown.OptionData();
            DO.text=ulsan[i];
            AreaTwo.options.Add(DO);
            }
            break;
            case 7:
            AreaTwo.options.Clear();
            AreaTwo.captionText.text=ganggido[0];
            for(int i=0;i<ganggido.Length;i++){
            Dropdown.OptionData DO=new Dropdown.OptionData();
            DO.text=ganggido[i];
            AreaTwo.options.Add(DO);
            }
            break;
            case 8:
            AreaTwo.options.Clear();
            AreaTwo.captionText.text=gangwando[0];
            for(int i=0;i<gangwando.Length;i++){
            Dropdown.OptionData DO=new Dropdown.OptionData();
            DO.text=gangwando[i];
            AreaTwo.options.Add(DO);
            }
            break;
            case 9:
            AreaTwo.options.Clear();
            AreaTwo.captionText.text=chungbook[0];
            for(int i=0;i<chungbook.Length;i++){
            Dropdown.OptionData DO=new Dropdown.OptionData();
            DO.text=chungbook[i];
            AreaTwo.options.Add(DO);
            }
            break;
            case 10:
            AreaTwo.options.Clear();
            AreaTwo.captionText.text=chungnam[0];
            for(int i=0;i<chungnam.Length;i++){
            Dropdown.OptionData DO=new Dropdown.OptionData();
            DO.text=chungnam[i];
            AreaTwo.options.Add(DO);
            }
            break;
            case 11:
            AreaTwo.options.Clear();
            AreaTwo.captionText.text=junlabookdo[0];
            for(int i=0;i<junlabookdo.Length;i++){
            Dropdown.OptionData DO=new Dropdown.OptionData();
            DO.text=junlabookdo[i];
            AreaTwo.options.Add(DO);
            }
            break;
            case 12:
            AreaTwo.options.Clear();
            AreaTwo.captionText.text=junlanamdo[0];
            for(int i=0;i<junlanamdo.Length;i++){
            Dropdown.OptionData DO=new Dropdown.OptionData();
            DO.text=junlanamdo[i];
            AreaTwo.options.Add(DO);
            }
            break;
            case 13:
            AreaTwo.options.Clear();
            AreaTwo.captionText.text=gangsanbookdo[0];
            for(int i=0;i<gangsanbookdo.Length;i++){
            Dropdown.OptionData DO=new Dropdown.OptionData();
            DO.text=gangsanbookdo[i];
            AreaTwo.options.Add(DO);
            }
            break;
            case 14:
            AreaTwo.options.Clear();
            AreaTwo.captionText.text=gangsannamdo[0];
            for(int i=0;i<gangsannamdo.Length;i++){
            Dropdown.OptionData DO=new Dropdown.OptionData();
            DO.text=gangsannamdo[i];
            AreaTwo.options.Add(DO);
            }
            break;
            case 15:
            AreaTwo.options.Clear();
            AreaTwo.captionText.text=jeju[0];
            for(int i=0;i<jeju.Length;i++){
            Dropdown.OptionData DO=new Dropdown.OptionData();
            DO.text=jeju[i];
            AreaTwo.options.Add(DO);
            }
            break;
            default:
            break;
            
        }
    }//시도 저장 알고리즘


    public void selectareatwo() 
    {
        if (AreaOne.captionText.text == "서울특별시")
        {
            if (AreaTwo.captionText.text == "강남구")
            {

                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in a1)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "강동구")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in a2)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "강북구")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in a3)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "강서구")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in a4)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "관악구")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in a5)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "광진구")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in a6)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "구로구")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in a7)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "금천구")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in a8)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "노원구")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in a9)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "도봉구")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in aa1)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "동대문구")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in aa1)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "동작구")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in aa2)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "마포구")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in aa3)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "서대문구")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in aa4)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "서초구")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in aa5)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "성동구")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in aa6)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "성북구")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in aa7)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "송파구")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in aa8)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "양천구")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in aa9)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "영등포구")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in aaa1)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "용산구")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in aaa2)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "은평구")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in aaa3)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "종로구")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in aaa4)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "중구")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in aaa5)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "중랑구")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in aaa6)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }


        }
        else if (AreaOne.captionText.text == "강원도")
        {
            if (AreaTwo.captionText.text == "강릉시")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in b1)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "고성군")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in b2)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "동해시")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in b3)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "삼척시")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in b4)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "속초시")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in b5)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "양구군")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in b6)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "양양군")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in b7)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "영월군")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in b8)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "원주시")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in b9)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "인제군")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in bb1)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "정선군")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in bb2)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "철원군")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in bb3)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "춘천시")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in bb4)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);

            }
            else if (AreaTwo.captionText.text == "태백시")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in bb5)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "평창군")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in bb6)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "홍천군")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in bb7)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "화천군")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in bb8)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "횡성군")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in bb9)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }


        }
        else if (AreaOne.captionText.text == "경기도")
        {
            if (AreaTwo.captionText.text == "가평군")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in c1)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "고양시덕양구")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in c2)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "고양시일산동구")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in c3)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "고양시일산서구")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in c4)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "과천시")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in c5)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "광명시")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in c6)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "광주시")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in c7)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "구리시")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in c8)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "군포시")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in c9)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "김포시")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in cc1)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "남양주시")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in cc2)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "동두천시")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in cc3)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "부천시")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in cc4)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "성남시분당구")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in cc5)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "성남시수정구")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in cc6)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "성남시중원구")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in cc7)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "수원시권선구")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in cc8)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "수원시영통구")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in cc9)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "수원시장안구")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in ccc1)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "수원시팔달구")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in ccc2)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "시흥시")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in ccc3)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "안산시단원구")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in ccc4)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "안산시상록구")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in ccc5)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "안성시")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in ccc6)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "안양시동안구")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in ccc7)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "안양시만안구")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in ccc8)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "양주시")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in ccc9)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "양평군")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in cccc1)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "여주시")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in cccc2)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "연천군")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in cccc3)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "오산시")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in cccc4)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "용인시기흥구")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in cccc5)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "용인시수지구")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in cccc6)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "용인시처인구")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in cccc7)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "의왕시")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in cccc8)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "의정부시")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in cccc9)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "이천시")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in ccccc1)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "파주시")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in ccccc2)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "평택시")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in ccccc3)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "포천시")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in ccccc4)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "하남시")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in ccccc5)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "화성시")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in ccccc6)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }

        }
        else if (AreaOne.captionText.text == "경상남도")
        {
            if (AreaTwo.captionText.text == "거제시")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in d1)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "거창군")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in d2)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "고성군")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in d3)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "김해시")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in d4)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "남해군")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in d5)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "밀양시")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in d6)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "사천시")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in d7)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "산청군")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in d8)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "양산시")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in d9)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "의령군")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in dd1)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "진주시")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in dd2)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "창녕군")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in dd3)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "창원시 마산합포구")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in dd4)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "창원시 마산회원구")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in dd5)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "창원시 성산구")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in dd6)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "창원시 의창구")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in dd7)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "창원시 진해구")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in dd8)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "통영시")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in dd9)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "하동군")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in ddd1)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "함안군")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in ddd2)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "함양군")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in ddd3)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "합천군")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in ddd4)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }

        }
        else if (AreaOne.captionText.text == "경상북도")
        {
            if (AreaTwo.captionText.text == "경산시")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in e1)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "경주시")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in e2)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "고령군")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in e3)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "구미시")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in e4)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "군위군")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in e5)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "김천시")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in e6)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "문경시")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in e7)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "봉화군")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in e8)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "상주시")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in e9)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "성주군")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in ee1)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "안동시")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in ee2)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "영덕군")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in ee3)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "영양군")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in ee4)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "영주시")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in ee5)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "영천시")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in ee6)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "예천군")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in ee7)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "울릉군")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in ee8)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "울진군")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in ee9)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "의성군")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in eee1)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "청도군")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in eee2)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "청송군")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in eee3)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "칠곡군")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in eee4)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "포항시남구")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in eee5)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "포항시북구")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in eee6)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }

        }
        else if (AreaOne.captionText.text == "광주광역시")
        {
            if (AreaTwo.captionText.text == "광산구")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in ff1)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "남구")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in ff2)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "동구")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in ff3)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "북구")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in ff4)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "서구")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in ff5)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
        }
        else if (AreaOne.captionText.text == "대구광역시")
        {
            if (AreaTwo.captionText.text == "남구")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in g1)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "달서구")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in g2)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "달성군")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in g3)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "동구")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in g4)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "북구")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in g5)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "서구")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in g6)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "수성구")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in g7)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "중구")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in g8)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
        }
        else if (AreaOne.captionText.text == "대전광역시")
        {
            if (AreaTwo.captionText.text == "대덕구")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in h1)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "동구")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in h2)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "서구")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in h3)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "유성구")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in h4)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "중구")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in h5)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
        }
        else if (AreaOne.captionText.text == "부산광역시")
        {
            if (AreaTwo.captionText.text == "강서구")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in i1)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "금정구")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in i2)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "기장군")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in i3)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "남구")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in i4)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "동구")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in i5)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "동래구")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in i6)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "부산진구")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in i7)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "북구")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in i8)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "사상구")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in i9)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "사하구")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in ii1)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "서구")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in ii2)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "수영구")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in ii3)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "연제구")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in ii4)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "영도구")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in ii5)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "중구")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in ii6)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "해운대구")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in ii7)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }

        }
        else if (AreaOne.captionText.text == "세종특별자치시")
        {
            if (AreaTwo.captionText.text == "세종특별자치시")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in j1)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
        }
        else if (AreaOne.captionText.text == "울산광역시")
        {
            if (AreaTwo.captionText.text == "남구")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in k1)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "동구")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in k2)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "북구")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in k3)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "울주군")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in k4)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "중구")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in k5)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
        }
        else if (AreaOne.captionText.text == "인천광역시")
        {
            if (AreaTwo.captionText.text == "강화군")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in l1)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "계양구")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in l2)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "남동구")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in l3)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "동구")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in l4)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "미추홀구")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in l5)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "부평구")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in l6)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "서구")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in l7)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "연수구")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in l8)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "옹진군")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in l9)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "중구")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in ll1)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
        }
        else if (AreaOne.captionText.text == "전라남도")
        {
            if (AreaTwo.captionText.text == "강진군")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in mn1)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "고흥군")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in mn2)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "곡성군")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in mn3)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "광양시")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in mn4)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "구례군")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in mn5)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "나주시")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in mn6)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "담양군")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in mn7)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "목포시")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in mn8)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "무안군")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in mn9)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "보성군")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in mmn1)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "순천시")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in mmn2)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "신안군")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in mmn3)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "여수시")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in mmn4)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "영광군")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in mmn5)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "영암군")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in mmn6)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "완도군")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in mmn7)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "장성군")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in mmn8)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "장흥군")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in mmn9)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "진도군")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in mmmn1)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "함평군")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in mmmn2)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);

            }
            else if (AreaTwo.captionText.text == "해남군")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in mmmn3)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "화순군")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in mmmn4)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }

        }
        else if (AreaOne.captionText.text == "전라북도")
        {
            if (AreaTwo.captionText.text == "고창군")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in n1)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "군산시")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in n2)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "김제시")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in n3)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "남원시")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in n4)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "무주군")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in n5)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "부안군")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in n6)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "순창군")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in n7)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "완주군")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in n8)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "익산시")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in n9)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "임실군")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in nn1)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "장수군")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in nn2)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "전주시덕진구")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in nn3)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "전주시완산구")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in nn4)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "정읍시")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in nn5)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "진안군")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in nn6)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
        }
        else if (AreaOne.captionText.text == "제주특별자치도")
        {
            if (AreaTwo.captionText.text == "서귀포시")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in o1)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "이어도")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in o2)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "제주시")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in o3)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }

        }
        else if (AreaOne.captionText.text == "충청남도")
        {
            if (AreaTwo.captionText.text == "계룡시")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in p1)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "공주시")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in p2)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "금산군")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in p3)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "논산시")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in p4)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "당진시")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in p5)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "보령시")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in p6)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "부여군")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in p7)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "서산시")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in p8)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "서천군")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in p9)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "아산시")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in pp1)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "예산군")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in pp2)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "천안시동남구")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in pp3)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "천안시서북구")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in pp4)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "청양군")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in pp5)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "태안군")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in pp6)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "홍성군")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in pp7)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
        }
        else if (AreaOne.captionText.text == "충청북도")
        {
            if (AreaTwo.captionText.text == "괴산군")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in qp1)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "단양군")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in qp2)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "보은군")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in qp3)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "영동군")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in qp4)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "옥천군")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in qp5)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "음성군")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in qp6)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "제천시")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in qp7)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "증평군")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in qp8)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "진천군")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in qp9)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "청주시상당구")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in qqp1)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "청주시서원구")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in qqp2)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "청주시청원구")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in qqp3)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }
            else if (AreaTwo.captionText.text == "청주시흥덕구")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in qqp4)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);

            }
            else if (AreaTwo.captionText.text == "충주시")
            {
                AreaThird.ClearOptions();
                //새로운 옵션 설정을 위한 optionData생성
                List<Dropdown.OptionData> optionList = new List<Dropdown.OptionData>();
                foreach (string str in qqp5)
                {
                    optionList.Add(new Dropdown.OptionData(str));
                }
                AreaThird.AddOptions(optionList);
            }

        }


    }//구군 선택 했을때 구군 데이터 변경
    public void PWSAME()//시도,구군,읍면도 지역을 하나로 뭉침
    {
        if(inputField_pw.text==inputField_repw.text){
            pwsametext.text="비밀번호가 일치합니다";
            pwsamecheck=true;
            pwsametext.color=Color.green;
        }
        else{
            pwsametext.text="비밀번호가 일치하지 않습니다";
            pwsamecheck=false;
            pwsametext.color=Color.red;
        }
    }
    
    public void RegButtonClick()//회원가입 버튼
    {
        ID=inputField_ID.text+"@"+inputField_email.text;
        password=inputField_pw.text;
        nicname=inputField_nic.text;
        msg.RegisterOK();
        RegisterPanel.SetActive(false);
        StartCoroutine(GetMySQLData());
    }//회원가입 버튼
    public IEnumerator GetMySQLData()
        {
            dictionary.Add("서울특별시_광진구_구의제3동",1121587000);
            TotalArea = AreaOne.captionText.text+ "_" + AreaTwo.captionText.text + "_" +AreaThird.captionText.text;
            string areatext = dictionary[TotalArea].ToString();
            string serverPath = "https://coco74591.cafe24.com/qwe.php?" + "UID="+ ID + "&UPW="+ password+ "&UNAME="+ nicname+"&ULOCAL="+ areatext; 

            using (UnityWebRequest webRequest = UnityWebRequest.Get(serverPath)) 
            {
                yield return webRequest.SendWebRequest();
                Debug.Log(webRequest.downloadHandler.text); 
            }
        }
}
